In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
old_HDDs = '../data/old_HDD.csv'
HDD = pd.read_csv(old_HDDs)
pd.set_option('display.max_columns', None)

HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [7]:
HDD[["first_name", "last_name", "title"]] = HDD[["first_name", "last_name", "title"]].apply(lambda x: x.str.title())

In [9]:
HDD.head()

  first_name last_name                  title  release_year  category_id
0   Penelope   Guiness       Academy Dinosaur          2006            6
1   Penelope   Guiness   Anaconda Confessions          2006            2
2   Penelope   Guiness            Angels Life          2006           13
3   Penelope   Guiness  Bulworth Commandments          2006           10
4   Penelope   Guiness          Cheaper Clyde          2006           14

In [10]:
HDD["release_year"] = "-0001"

In [11]:
HDD.head()

  first_name last_name                  title release_year  category_id
0   Penelope   Guiness       Academy Dinosaur        -0001            6
1   Penelope   Guiness   Anaconda Confessions        -0001            2
2   Penelope   Guiness            Angels Life        -0001           13
3   Penelope   Guiness  Bulworth Commandments        -0001           10
4   Penelope   Guiness          Cheaper Clyde        -0001           14

In [12]:
column_title = HDD['title']


HDD.drop(columns=['title'], inplace=True)


HDD.insert(0, 'title', column_title)

In [13]:
HDD.head()

                   title first_name last_name release_year  category_id
0       Academy Dinosaur   Penelope   Guiness        -0001            6
1   Anaconda Confessions   Penelope   Guiness        -0001            2
2            Angels Life   Penelope   Guiness        -0001           13
3  Bulworth Commandments   Penelope   Guiness        -0001           10
4          Cheaper Clyde   Penelope   Guiness        -0001           14